In [118]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn
import re

#### Import the data and get a high-level picture

In [119]:
df = pd.read_csv('sales.csv')
df.head()

,order_id,name,ordered_at,price,quantity,line_total
0,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,$3.50,3,$10.50
1,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,$3.50,1,$3.50
2,10001,"""SORBET"" Raspberry",2018-01-01 12:14:54,$2.50,2,$5.00
3,10001,NaN,2018-01-01 12:14:54,$1.50,1,$1.50
4,10001,"""CONE"" Dipped Waffle Cone",2018-01-01 12:14:54,$3.50,1,$3.50

In [120]:
df.shape

(29922, 6)

In [121]:
df.dtypes

order_id       int64
name          object
ordered_at    object
price         object
quantity       int64
line_total    object
dtype: object

#### TODO: Fix column datatypes

Change ordered_at to datetime

Change price and line_total to float

In [122]:
# ordered_at to datetime
df["ordered_at"] = df["ordered_at"].apply(pd.to_datetime)
df.head()

,order_id,name,ordered_at,price,quantity,line_total
0,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,$3.50,3,$10.50
1,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,$3.50,1,$3.50
2,10001,"""SORBET"" Raspberry",2018-01-01 12:14:54,$2.50,2,$5.00
3,10001,NaN,2018-01-01 12:14:54,$1.50,1,$1.50
4,10001,"""CONE"" Dipped Waffle Cone",2018-01-01 12:14:54,$3.50,1,$3.50

In [124]:
# price and line_total to float
df[['price','line_total']]=(df[['price','line_total']].replace( '[\$,)]','', regex=True)).astype(float)
# regex is true as otherwise its an ordinarry python replace which doesnt work for 2 columsn

#### TODO: drop if duplicated or null

In [125]:
df[df.duplicated()].shape[0]
#len(df)

538

In [126]:
df = df.dropna()
df.head()

,order_id,name,ordered_at,price,quantity,line_total
0,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,3.5,3,10.5
1,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,3.5,1,3.5
2,10001,"""SORBET"" Raspberry",2018-01-01 12:14:54,2.5,2,5.0
4,10001,"""CONE"" Dipped Waffle Cone",2018-01-01 12:14:54,3.5,1,3.5
5,10002,"""SORBET"" Lychee",2018-01-01 12:23:09,3.0,1,3.0

In [127]:
df.isnull().sum()

order_id      0
name          0
ordered_at    0
price         0
quantity      0
line_total    0
dtype: int64

In [128]:
df[df['name'].isnull()].head()

Empty DataFrame
Columns: [order_id, name, ordered_at, price, quantity, line_total]
Index: []

#### Sanity check for value ranges and to check assumptions

In [129]:
df[(df['price'] * df['quantity']) != df['line_total']].shape[0]

29

In [130]:
df[df['line_total'] < 0].shape[0]

282

#### TODO: 
Set line_total = price * quantity if different
Remove if line total < 0

In [131]:
df['line_total'] = df['price']*df['quantity']

In [132]:
df =df[df['line_total'] > 0]

In [133]:
df.describe()

           order_id         price      quantity    line_total
count  28152.000000  28152.000000  28152.000000  28152.000000
mean   14991.953396      2.510319      2.001705      5.027955
std     2888.586572      1.059779      0.819506      3.085916
min    10000.000000      0.500000      1.000000      0.500000
25%    12500.750000      1.500000      1.000000      2.500000
50%    14967.500000      2.500000      2.000000      4.500000
75%    17506.000000      3.500000      3.000000      7.500000
max    19999.000000      4.000000      3.000000     12.000000

#### TODO: Get value between "" in name and put it in category column

In [141]:
category= df['name'].str.strip(" "" ")

In [142]:
df['category'] = category

In [143]:
df.head()

,order_id,name,ordered_at,price,quantity,line_total,category
0,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,3.5,3,10.5,"""ICE CREAM"" Peanut Fudge"
1,10000,"""ICE CREAM"" Peanut Fudge",2018-01-01 11:30:00,3.5,1,3.5,"""ICE CREAM"" Peanut Fudge"
2,10001,"""SORBET"" Raspberry",2018-01-01 12:14:54,2.5,2,5.0,"""SORBET"" Raspberry"
4,10001,"""CONE"" Dipped Waffle Cone",2018-01-01 12:14:54,3.5,1,3.5,"""CONE"" Dipped Waffle Cone"
5,10002,"""SORBET"" Lychee",2018-01-01 12:23:09,3.0,1,3.0,"""SORBET"" Lychee"

#### Analysis, finally!

In [ ]:
f, ax = plt.subplots(figsize=(10, 6))
df.groupby('name')['line_total'].sum().sort_values(ascending=False).head(10).plot(kind='bar')
f.autofmt_xdate()
plt.show()